# SQL Built-in functions

## First, let's consider the table EMPLOYEES

In [1]:
% load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%%sql

CREATE TABLE EMPLOYEES (
                            EMP_ID CHAR(9) NOT NULL, 
                            F_NAME VARCHAR(15) NOT NULL,
                            L_NAME VARCHAR(15) NOT NULL,
                            SSN CHAR(9),
                            B_DATE DATE,
                            SEX CHAR,
                            ADDRESS VARCHAR(30),
                            JOB_ID CHAR(9),
                            SALARY DECIMAL(10,2),
                            MANAGER_ID CHAR(9),
                            DEP_ID CHAR(9) NOT NULL,
                            PRIMARY KEY (EMP_ID));

 * sqlite://
Done.

[]

In [4]:
%%sql

insert into EMPLOYEES
(EMP_ID, F_NAME, L_NAME, SSN, B_DATE, SEX, ADDRESS, JOB_ID, SALARY, MANAGER_ID, DEP_ID)
VALUES
('E1001','John', 'Thomas','123456','01/09/1976','M','"5631 Rice, OakPark,IL"','100','100000','30001','2'),
('E1002','Alice','James','123457','07/31/1972','F',"980 Berry ln, Elgin,IL",'200','80000','30002','5'),
('E1003','Steve','Wells','123458','08/10/1980','M',"291 Springs, Gary,IL",'300','50000','30002','5'),
('E1004','Santosh','Kumar','123459','07/20/1985','M',"511 Aurora Av, Aurora,IL",'400','60000','30004','5'),
('E1005','Ahmed','Hussain','123410','01/04/1981','M',"216 Oak Tree, Geneva,IL",'500','70000','30001','2'),
('E1006','Nancy','Allen','123411','02/06/1978','F',"111 Green Pl, Elgin,IL",'600','90000','30001','2'),
('E1007','Mary','Thomas','123412','05/05/1975','F',"100 Rose Pl, Gary,IL",'650','65000','30003','7'),
('E1008','Bharath','Gupta','123413','05/06/1985','M',"145 Berry Ln, Naperville,IL",'660','65000','30003','7'),
('E1009','Andrea','Jones','123414','07/09/1990','F',"120 Fall Creek, Gary,IL",'234','70000','30003','7'),
('E1010','Ann','Jacob','123415','03/30/1982','F',"111 Britany Springs,Elgin,IL",'220','70000','30004','5')

 * sqlite://
10 rows affected.

[]

In [5]:
%%sql

select * from EMPLOYEES

 * sqlite://
Done.

[('E1001', 'John', 'Thomas', '123456', '01/09/1976', 'M', '"5631 Rice, OakPark,IL"', '100', 100000, '30001', '2'),
 ('E1002', 'Alice', 'James', '123457', '07/31/1972', 'F', '980 Berry ln, Elgin,IL', '200', 80000, '30002', '5'),
 ('E1003', 'Steve', 'Wells', '123458', '08/10/1980', 'M', '291 Springs, Gary,IL', '300', 50000, '30002', '5'),
 ('E1004', 'Santosh', 'Kumar', '123459', '07/20/1985', 'M', '511 Aurora Av, Aurora,IL', '400', 60000, '30004', '5'),
 ('E1005', 'Ahmed', 'Hussain', '123410', '01/04/1981', 'M', '216 Oak Tree, Geneva,IL', '500', 70000, '30001', '2'),
 ('E1006', 'Nancy', 'Allen', '123411', '02/06/1978', 'F', '111 Green Pl, Elgin,IL', '600', 90000, '30001', '2'),
 ('E1007', 'Mary', 'Thomas', '123412', '05/05/1975', 'F', '100 Rose Pl, Gary,IL', '650', 65000, '30003', '7'),
 ('E1008', 'Bharath', 'Gupta', '123413', '05/06/1985', 'M', '145 Berry Ln, Naperville,IL', '660', 65000, '30003', '7'),
 ('E1009', 'Andrea', 'Jones', '123414', '07/09/1990', 'F', '120 Fall Creek, Gary,IL', '234', 70000, '30003', '7'),
 ('E1010', 'Ann', 'Jacob', '123415', '03/30/1982', 'F', '111 Britany Springs,Elgin,IL', '220', 70000, '30004', '5')]

## Built-in functions

In [10]:
%%sql

;
select MIN(SALARY) from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(50000,)]

In [16]:
%%sql

;
select MAX(SALARY) from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(100000,)]

In [13]:
%%sql

;
select AVG(SALARY) from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(72000.0,)]

In [15]:
%%sql

;
select SUM(SALARY) from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(720000,)]

## Labels

In [23]:
%%sql

;
select SUM(SALARY) as SUM_OF_SALARIES from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(720000,)]

## Where clause

In [22]:
%%sql

;
select SUM(SALARY) as SUM_FEMALE 
from EMPLOYEES
where SEX = 'F';

 * sqlite://
0 rows affected.
Done.

[(375000,)]

In [29]:
%%sql

;
select AVG(SALARY / DEP_ID) as AVG_FEMALE_PER_DEP
from EMPLOYEES
where sex = 'F';

 * sqlite://
0 rows affected.
Done.

[(18857.0,)]

## Other functions

In [25]:
%%sql

;
select ROUND(SALARY) as ROUND
from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(100000.0,),
 (80000.0,),
 (50000.0,),
 (60000.0,),
 (70000.0,),
 (90000.0,),
 (65000.0,),
 (65000.0,),
 (70000.0,),
 (70000.0,)]

In [32]:
%%sql

;
select length(F_NAME) 
from EMPLOYEES;

 * sqlite://
0 rows affected.
Done.

[(4,), (5,), (5,), (7,), (5,), (5,), (4,), (7,), (6,), (3,)]

In [34]:
%%sql

;
select UCASE(F_NAME)
from EMPLOYEES;

 * sqlite://
0 rows affected.
(sqlite3.OperationalError) no such function: UCASE [SQL: 'select UCASE(F_NAME)\nfrom EMPLOYEES;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [35]:
%%sql

;
select LCASE(F_NAME)
from EMPLOYEES;

 * sqlite://
0 rows affected.
(sqlite3.OperationalError) no such function: LCASE [SQL: 'select LCASE(F_NAME)\nfrom EMPLOYEES;'] (Background on this error at: http://sqlalche.me/e/e3q8)

## Now, consider the table PETSALE

In [50]:
%%sql

create table PETSALE (
ID INTEGER PRIMARY KEY NOT NULL,
ANIMAL VARCHAR(20),
QUANTITY INTEGER,
SALEPRICE DECIMAL(6,2),
SALEDATE DATE
);

 * sqlite://
Done.

[]

In [51]:
%%sql

insert into PETSALE values 
(1,'Cat',9,450.09,'2018-05-29'),
(2,'Dog',3,666.66,'2018-06-01'),
(3,'Dog',1,100.00,'2018-06-04'),
(4,'Parrot',2,50.00,'2018-06-04'),
(5,'Dog',1,75.75,'2018-06-10'),
(6,'Hamster',6,60.60,'2018-06-11'),
(7,'Cat',1,44.44,'2018-06-11'),
(8,'Goldfish',24,48.48,'2018-06-14'),
(9,'Dog',2,222.22,'2018-06-15')
;

 * sqlite://
9 rows affected.

[]

In [53]:
%%sql

;
select * from PETSALE;

 * sqlite://
0 rows affected.
Done.

[(1, 'Cat', 9, 450.09, '2018-05-29'),
 (2, 'Dog', 3, 666.66, '2018-06-01'),
 (3, 'Dog', 1, 100, '2018-06-04'),
 (4, 'Parrot', 2, 50, '2018-06-04'),
 (5, 'Dog', 1, 75.75, '2018-06-10'),
 (6, 'Hamster', 6, 60.6, '2018-06-11'),
 (7, 'Cat', 1, 44.44, '2018-06-11'),
 (8, 'Goldfish', 24, 48.48, '2018-06-14'),
 (9, 'Dog', 2, 222.22, '2018-06-15')]

In [54]:
%%sql

select SUM(SALEPRICE) from PETSALE;

 * sqlite://
Done.

[(1718.24,)]

In [55]:
%%sql

select SUM(SALEPRICE) AS SUM_OF_SALEPRICE from PETSALE;

 * sqlite://
Done.

[(1718.24,)]

In [56]:
%%sql

select MAX(QUANTITY) from PETSALE;

 * sqlite://
Done.

[(24,)]

In [57]:
%%sql

select AVG(SALEPRICE) from PETSALE;

 * sqlite://
Done.

[(190.91555555555556,)]

In [59]:
%%sql

select AVG( SALEPRICE / QUANTITY ) from PETSALE where ANIMAL = 'Dog';

 * sqlite://
Done.

[(127.27000000000001,)]

In [60]:
%%sql

select ROUND(SALEPRICE) from PETSALE;

 * sqlite://
Done.

[(450.0,),
 (667.0,),
 (100.0,),
 (50.0,),
 (76.0,),
 (61.0,),
 (44.0,),
 (48.0,),
 (222.0,)]

In [61]:
%%sql

select LENGTH(ANIMAL) from PETSALE;

 * sqlite://
Done.

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

In [62]:
%%sql

select UCASE(ANIMAL) from PETSALE;

 * sqlite://
(sqlite3.OperationalError) no such function: UCASE [SQL: 'select UCASE(ANIMAL) from PETSALE;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [63]:
%%sql

select DISTINCT(UCASE(ANIMAL)) from PETSALE;

 * sqlite://
(sqlite3.OperationalError) no such function: UCASE [SQL: 'select DISTINCT(UCASE(ANIMAL)) from PETSALE;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [64]:
%%sql

select * from PETSALE where LCASE(ANIMAL) = 'cat';

 * sqlite://
(sqlite3.OperationalError) no such function: LCASE [SQL: "select * from PETSALE where LCASE(ANIMAL) = 'cat';"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [65]:
%%sql

select DAY(SALEDATE) from PETSALE where ANIMAL = 'Cat';

 * sqlite://
(sqlite3.OperationalError) no such function: DAY [SQL: "select DAY(SALEDATE) from PETSALE where ANIMAL = 'Cat';"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [67]:
%%sql

select COUNT(*) from PETSALE where MONTH(SALEDATE)='05';

 * sqlite://
(sqlite3.OperationalError) no such function: MONTH [SQL: "select COUNT(*) from PETSALE where MONTH(SALEDATE)='05';"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [68]:
%%sql

select (SALEDATE + 3 DAYS) from PETSALE;

 * sqlite://
(sqlite3.OperationalError) near "DAYS": syntax error [SQL: 'select (SALEDATE + 3 DAYS) from PETSALE;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [69]:
%%sql

select (CURRENT DATE - SALEDATE) from PETSALE;

 * sqlite://
(sqlite3.OperationalError) near "DATE": syntax error [SQL: 'select (CURRENT DATE - SALEDATE) from PETSALE;'] (Background on this error at: http://sqlalche.me/e/e3q8)